Обработки/Reports/_ПроверкаНаОбесценениеАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПроверкаНаОбесценениеАктивов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПроверкаНаОбесценениеАктивов/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Проверка на обесценение активов",
		"0.02",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Клиент);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат);	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
		
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ПодписантОтКлиента");
	Возврат Настройки;

КонецФункции

Функция ВернутьФИОПодписанта(Подписант)
	
	ФИО = Новый Структура;
	
	Если ТипЗнч(Подписант) = Тип("СправочникСсылка.ЮрФизЛица") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК ФИОПолностью,
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицСрезПоследних.Отчество, 1, 1) + ""."" КАК ФИОСокращенно
		|ИЗ
		|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ЮрФизЛицо", Подписант);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ФИО.Вставить("ФИОПолностью", Выборка.ФИОПолностью);
			ФИО.Вставить("ФИОСокращенно", Выборка.ФИОСокращенно);
			
		КонецЕсли;	
	Иначе //строка	
		СтрокаФИО = Подписант;
		
		Если Найти(СтрокаФИО, ".") > 0 Тогда         //только Фамилия И. О. 
			ФИО.Вставить("ФИОПолностью", СтрокаФИО);
			ФИО.Вставить("ФИОСокращенно", СтрокаФИО);
		Иначе	
			МассивФИО = СтрРазделить(СтрокаФИО, " ");
			Если МассивФИО.Количество() = 3 Тогда
				ФИОСокращенно = МассивФИО[0] + " " + Лев(МассивФИО[1],1) + ". " + Лев(МассивФИО[2],1) + ". ";
				
				ФИО.Вставить("ФИОПолностью", СтрокаФИО);
				ФИО.Вставить("ФИОСокращенно", ФИОСокращенно);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаФИО + " не является строкой типа ФИО");
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат ФИО;
	
	
КонецФункции	

Функция УстановитьСтатусыНарушений(Выборка, ЕстьСвиделельтва)
	
	Результат = Новый Структура("Затруднения, НарушенияДоговора, Банкрот, Активность, НаблюдаемыеДанные",
				"не выявлено",
				"не выявлено",
				"не выявлено",
				"не выявлено",
				"не наблюдается");
	
	СостояниеДефолта = "";
	Если Выборка.ДефолтПоКупону Тогда 
		СостояниеДефолта = "дефолт по купону"; 
	КонецЕсли;	
	Если Выборка.ДефолтПоТелу Тогда 
		СтрДополнение = "дефолт по телу";		
		СостояниеДефолта = ?(ПустаяСтрока(СостояниеДефолта), СтрДополнение, СостояниеДефолта + ", " + СтрДополнение);
	КонецЕсли;	
	Если Выборка.НеисполнениеОферты Тогда 
		СтрДополнение = "неисполнение оферты";
		СостояниеДефолта = ?(ПустаяСтрока(СостояниеДефолта), СтрДополнение, СостояниеДефолта + ", " + СтрДополнение);
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СостояниеДефолта) Тогда 
		Результат.НарушенияДоговора = СостояниеДефолта;
	КонецЕсли;	
	
	Если Выборка.Банкротство Тогда 
		Результат.Банкрот = "банкрот";  //может быть скоро будет расшифрофка состояний банкротства
	КонецЕсли;	
	
	Если НЕ Выборка.Активен Тогда
		Результат.Активность = "выявлено";
	КонецЕсли;	
	
	Если Выборка.Резерв ИЛИ Выборка.ДефолтПоКупону ИЛИ Выборка.ДефолтПоТелу ИЛИ Выборка.НеисполнениеОферты ИЛИ Выборка.Банкротство ИЛИ НЕ Выборка.Активен Тогда
		Результат.Затруднения = "есть затруднения";
		Результат.НаблюдаемыеДанные = "наблюдаются";
		ЕстьСвиделельтва = Истина;
	КонецЕсли;	
			
	Возврат Результат;	
	
КонецФункции	

Процедура Сформировать(ДокументРезультат)	Экспорт
	
	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,Клиент");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	Попытка
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаОтчета,
		|			Организация = &Организация
		|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Банк КАК Банк
		|ПОМЕСТИТЬ _Банки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Контрагент КАК Брокер
		|ПОМЕСТИТЬ _Брокеры
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДефолтыПоОблигациямСрезПоследних.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.КупонныеВыплаты)
		|					И ДефолтыПоОблигациямСрезПоследних.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ДефолтПоКупону,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДефолтыПоОблигациямСрезПоследних.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ИсполнениеОферты)
		|					И (ДефолтыПоОблигациямСрезПоследних.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.НеисполнениеОферты)
		|						ИЛИ ДефолтыПоОблигациямСрезПоследних.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт))
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК НеисполнениеОферты,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДефолтыПоОблигациямСрезПоследних.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)
		|					И ДефолтыПоОблигациямСрезПоследних.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ДефолтПоТелу,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДефолтыПоОблигациямСрезПоследних.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.Банкротство)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Банкротство,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация КАК Облигация
		|ПОМЕСТИТЬ _Дефолты
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(&ДатаОтчета, ) КАК ДефолтыПоОблигациямСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДефолтыПоОблигациямСрезПоследних.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаРезерв
		|ПОМЕСТИТЬ _ЦБРезервы
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В (&СчетаРезервов),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РегНомер,
		|	НЕ _ЦБРезервы.ЦеннаяБумага ЕСТЬ NULL КАК Резерв,
		|	СтатусыЦенныхБумагСрезПоследних.Активен КАК Активен,
		|	ЕСТЬNULL(_Дефолты.ДефолтПоКупону, ЛОЖЬ) КАК ДефолтПоКупону,
		|	ЕСТЬNULL(_Дефолты.НеисполнениеОферты, ЛОЖЬ) КАК НеисполнениеОферты,
		|	ЕСТЬNULL(_Дефолты.ДефолтПоТелу, ЛОЖЬ) КАК ДефолтПоТелу,
		|	ЕСТЬNULL(_Дефолты.Банкротство, ЛОЖЬ) КАК Банкротство,
		|	ЕСТЬNULL(_ЦБРезервы.СуммаРезерв, 0) КАК СуммаРезерва
		|ПОМЕСТИТЬ _ЦБпоАмортизированной
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦБРезервы КАК _ЦБРезервы
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ЦБРезервы.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
		|				&ДатаОтчета,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже)
		|					И Биржа = &ММВБ) КАК СтатусыЦенныхБумагСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = СтатусыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Дефолты КАК _Дефолты
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _Дефолты.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РегНомер,
		|	НЕ _ЦБРезервы.ЦеннаяБумага ЕСТЬ NULL КАК Резерв,
		|	СтатусыЦенныхБумагСрезПоследних.Активен КАК Активен,
		|	ЕСТЬNULL(_Дефолты.ДефолтПоКупону, ЛОЖЬ) КАК ДефолтПоКупону,
		|	ЕСТЬNULL(_Дефолты.НеисполнениеОферты, ЛОЖЬ) КАК НеисполнениеОферты,
		|	ЕСТЬNULL(_Дефолты.ДефолтПоТелу, ЛОЖЬ) КАК ДефолтПоТелу,
		|	ЕСТЬNULL(_Дефолты.Банкротство, ЛОЖЬ) КАК Банкротство,
		|	ЕСТЬNULL(_ЦБРезервы.СуммаРезерв, 0) КАК СуммаРезерва
		|ПОМЕСТИТЬ _ЦБпоСправедливой
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦБРезервы КАК _ЦБРезервы
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ЦБРезервы.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
		|				&ДатаОтчета,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже)
		|					И Биржа = &ММВБ) КАК СтатусыЦенныхБумагСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = СтатусыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Дефолты КАК _Дефолты
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _Дефолты.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаРезерва
		|ПОМЕСТИТЬ _РезервРЕПО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕСТЬNULL(_РезервРЕПО.СуммаРезерва, 0) КАК СуммаРезерва
		|ПОМЕСТИТЬ _РЕПО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства10), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства11)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервРЕПО КАК _РезервРЕПО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _РезервРЕПО.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаРезерва
		|ПОМЕСТИТЬ _РезервДебиторка
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ04), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ05)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Контрагент,
		|	ЕСТЬNULL(_РезервДебиторка.СуммаРезерва, 0) КАК СуммаРезерва
		|ПОМЕСТИТЬ _Дебиторка
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДатаОтчета,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02))
		|				И Счет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РезервДебиторка КАК _РезервДебиторка
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _РезервДебиторка.Контрагент";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Клиент);
	Запрос.УстановитьПараметр("ДатаОтчета", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));


	СчетаУчетаЦенныхБумаг = КонсолидированнаяОтчетность.ПолучитьСчетаУчетаЦенныхБумаг();
	Запрос.УстановитьПараметр("СчетаРезервов", СчетаУчетаЦенныхБумаг.СчетаРезервовДолговых);

	ДатаОтчета = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ДатаОтчетаСМесяцем = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДЛФ=DD");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отчет = ПолучитьМакет("Отчет"); 
	ОбластьЗаголовок = Отчет.ПолучитьОбласть("Заголовок"); 
	ОбластьБанк = Отчет.ПолучитьОбласть("Банк"); 
	ОбластьБрокер = Отчет.ПолучитьОбласть("Брокер"); 
	ОбластьЦБАмортизация = Отчет.ПолучитьОбласть("ЦБАмортизация"); 
	ОбластьЦБСправедливая = Отчет.ПолучитьОбласть("ЦБСправедливая"); 
	ОбластьРЕПО = Отчет.ПолучитьОбласть("РЕПО"); 
	ОбластьДебиторка = Отчет.ПолучитьОбласть("Дебиторка"); 
	ОбластьПодписи = Отчет.ПолучитьОбласть("Подписи");
	ОбластьПустаяСтрока = Отчет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьРезерв = Отчет.ПолучитьОбласть("Резерв");
	
	ВыборкаСчетаДУ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СчетаДУ").ПолучитьДанные().Выгрузить(); 
	ВыборкаСчетаДУ.Сортировать("НомерДоговора");
	
	СписокДоговоров = ""; 
	СведенияОбОрганизации = Неопределено;
	Для Каждого СчетДУ Из ВыборкаСчетаДУ Цикл 
		
		Если СведенияОбОрганизации = Неопределено Тогда 
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СчетДУ.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);	
		КонецЕсли;	

		СписокДоговоров = СписокДоговоров + "№" + СчетДУ.НомерДоговора + ", ";
	КонецЦикла;	
	СписокДоговоров = Лев(СписокДоговоров, СтрДлина(СписокДоговоров)-2) + ".";
	
	ОбластьЗаголовок.Параметры.НаименованиеКлиент = ПолучитьСклоненияСтроки(СведенияОбОрганизации.ПолноеНаименование, , "ПД=Творительный")[0]; 
	ОбластьЗаголовок.Параметры.НаименованиеУК = ПолучитьСклоненияСтроки(СведенияОбОрганизации.ПолноеНаименованиеОрганизации, , "ПД=Творительный")[0]; 	
	ОбластьЗаголовок.Параметры.СписокДоговоров = СписокДоговоров;
	ОбластьЗаголовок.Параметры.ДатаОтчетаСМесяцем = ДатаОтчетаСМесяцем;
	ОбластьЗаголовок.Параметры.Год = Формат (Год(ЭтотОбъект.Период.ДатаОкончания), "ЧГ=0");
		
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьПустаяСтрока);

	ЕстьСвиделельтваОбОбесценении = Ложь;
	//банки
	ВыборкаБанки = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Банки").ПолучитьДанные().Выбрать();
	Пока ВыборкаБанки.Следующий() Цикл 
		
		ОбластьБанк.Параметры.Банк = ВыборкаБанки.Банк;
		ОбластьБанк.Параметры.ДатаОтчета = ДатаОтчета;
		ДокументРезультат.Вывести(ОбластьБанк);
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;	
	
	//Брокеры
	ВыборкаБрокеры = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Брокеры").ПолучитьДанные().Выбрать();
	Пока ВыборкаБрокеры.Следующий() Цикл 
		
		ОбластьБрокер.Параметры.Брокер = ВыборкаБрокеры.Брокер;
		ОбластьБрокер.Параметры.ДатаОтчета = ДатаОтчета;
		ДокументРезультат.Вывести(ОбластьБрокер);
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;	
	
	//ЦБ по амортизированной 
	ВыборкаЦБ  = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЦБпоАмортизированной").ПолучитьДанные().Выбрать();
	Пока ВыборкаЦБ.Следующий() Цикл 
		Нарушения =  УстановитьСтатусыНарушений(ВыборкаЦБ, ЕстьСвиделельтваОбОбесценении);
		ЗаполнитьЗначенияСвойств(ОбластьЦБАмортизация.Параметры, Нарушения);
				
		ОбластьЦБАмортизация.Параметры.Эмитент = ВыборкаЦБ.Эмитент;
		ОбластьЦБАмортизация.Параметры.РегНомер = ВыборкаЦБ.РегНомер;
		ОбластьЦБАмортизация.Параметры.ДатаОтчета = ДатаОтчета;
		
		ДокументРезультат.Вывести(ОбластьЦБАмортизация);
		Если ВыборкаЦБ.СуммаРезерва <> 0 Тогда 
			ОбластьРезерв.Параметры.СуммаРезерва = ВыборкаЦБ.СуммаРезерва;
			ДокументРезультат.Вывести(ОбластьРезерв);	
		КонецЕсли;	
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);

		
	КонецЦикла;	
	         
	//ЦБ по справедливой 
	ВыборкаЦБ  = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЦБпоСправедливой").ПолучитьДанные().Выбрать();
	Пока ВыборкаЦБ.Следующий() Цикл 
		
		Нарушения =  УстановитьСтатусыНарушений(ВыборкаЦБ, ЕстьСвиделельтваОбОбесценении);
		ЗаполнитьЗначенияСвойств(ОбластьЦБСправедливая.Параметры, Нарушения);
				
		ОбластьЦБСправедливая.Параметры.Эмитент = ВыборкаЦБ.Эмитент;
		ОбластьЦБСправедливая.Параметры.РегНомер = ВыборкаЦБ.РегНомер;
		ОбластьЦБСправедливая.Параметры.ДатаОтчета = ДатаОтчета;
		
		ДокументРезультат.Вывести(ОбластьЦБСправедливая);
		Если ВыборкаЦБ.СуммаРезерва <> 0 Тогда 
			ОбластьРезерв.Параметры.СуммаРезерва = ВыборкаЦБ.СуммаРезерва;
			ДокументРезультат.Вывести(ОбластьРезерв);	
		КонецЕсли;			
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;	
	
	//РЕПО
	ВыборкаКонтрагенты  = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РЕПО").ПолучитьДанные().Выбрать();
	Пока ВыборкаКонтрагенты.Следующий() Цикл 
		
		Нарушения = Новый Структура("Затруднения, НарушенияДоговора, Банкрот",
				"не выявлено",
				"не выявлено",
				"не выявлено");
		
		Если  ВыборкаКонтрагенты.СуммаРезерва <> 0 Тогда 
			Нарушения.Затруднения = "есть затруднения";		
			ЕстьСвиделельтваОбОбесценении = Истина;
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(ОбластьРЕПО.Параметры, Нарушения);		
			
		ОбластьРЕПО.Параметры.Контрагент = ВыборкаКонтрагенты.Контрагент;
		ОбластьРЕПО.Параметры.ДатаОтчета = ДатаОтчета;
		ДокументРезультат.Вывести(ОбластьРЕПО);
		Если ВыборкаКонтрагенты.СуммаРезерва <> 0 Тогда 
			ОбластьРезерв.Параметры.СуммаРезерва = ВыборкаКонтрагенты.СуммаРезерва;
			ДокументРезультат.Вывести(ОбластьРезерв);	
		КонецЕсли;			
		
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;	
	
	//Дебиторка
	ВыборкаКонтрагенты  = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Дебиторка").ПолучитьДанные().Выбрать();
	Пока ВыборкаКонтрагенты.Следующий() Цикл 
		
		Нарушения = Новый Структура("Затруднения, НарушенияДоговора, Банкрот",
				"не выявлено",
				"не выявлено",
				"не выявлено");
		
		Если  ВыборкаКонтрагенты.СуммаРезерва <> 0 Тогда 
			Нарушения.Затруднения = "есть затруднения";	
			ЕстьСвиделельтваОбОбесценении = Истина;
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(ОбластьДебиторка.Параметры, Нарушения);		
		
		ОбластьДебиторка.Параметры.Контрагент = ВыборкаКонтрагенты.Контрагент;
		ОбластьДебиторка.Параметры.ДатаОтчета = ДатаОтчета;
		ДокументРезультат.Вывести(ОбластьДебиторка);
		Если ВыборкаКонтрагенты.СуммаРезерва <> 0 Тогда 
			ОбластьРезерв.Параметры.СуммаРезерва = ВыборкаКонтрагенты.СуммаРезерва;
			ДокументРезультат.Вывести(ОбластьРезерв);	
		КонецЕсли;					
		ДокументРезультат.Вывести(ОбластьПустаяСтрока);	
		
	КонецЦикла;	
	
	//Заключение	
	Если ЕстьСвиделельтваОбОбесценении Тогда 
		ОбластьЗаключение = Отчет.ПолучитьОбласть("Заключение2"); 
	Иначе	
		ОбластьЗаключение = Отчет.ПолучитьОбласть("Заключение"); 
		ОбластьЗаключение.Параметры.ДатаОтчетаСМесяцем = ДатаОтчетаСМесяцем;
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьЗаключение);
	ДокументРезультат.Вывести(ОбластьПустаяСтрока);
	
	//Подписи			
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда 
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;	
		Если ЗначениеЗаполнено(СтруктураДанныхРуководитель) Тогда
			ОбластьПодписи.Параметры.Подписант = ВернутьФИОПодписанта(СтруктураДанныхРуководитель.КонтактноеЛицо).ФИОСокращенно;		
			ОбластьПодписи.Параметры.Должность = СтруктураДанныхРуководитель.Должность;
		КонецЕсли;	
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьПодписи);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "Отчет.ПроверкаНаОбесценение", , ОриентацияСтраницы.Портрет);
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
		
КонецПроцедуры
